# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [38]:
# Libraries
import pandas as pd

# Challenge 1 - Index Functions

In this challenge, we will practice the advanced functions introduced in the lesson. However, before we start, we will load and evaluate our dataset. 

Load the dataset from Ironhack's database:
* db: `admission_predict`
* table: `admission_predict`

In [84]:
# your code here
db = pd.read_csv("./Admission_Predict.csv")

Remove trailing spaces at the end of the column names if there are any.

In [85]:
# your code here
db.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

Let's evaluate the dataset by looking at the `head` function.

In [86]:
# your code here
col_names = db.columns

In [87]:
# With for loop
new_names = []
for i in col_names:
    new_names.append(i.strip())

In [88]:
# With list comprenhensions
new_names_ls = [i.strip() for i in col_names]

In [89]:
new_names_ls

['Serial No.',
 'GRE Score',
 'TOEFL Score',
 'University Rating',
 'SOP',
 'LOR',
 'CGPA',
 'Research',
 'Chance of Admit']

In [90]:
db.columns = new_names_ls

In [111]:
db.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

In [112]:
db.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR', 'CGPA', 'Research', 'Chance of Admit'],
      dtype='object')

Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [113]:
# your code here
db.isnull().values.any()

False

In [114]:
# There are no missing values, but if we would have a True I would count how many there are in the different columns.
db.isnull().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [115]:
# your code here
db.index = db["Serial No."]

In [116]:
db.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
2,2,316,104,3,3.0,3.5,8.00,1,0.72
3,3,322,110,3,3.5,2.5,8.67,1,0.80
4,4,314,103,2,2.0,3.0,8.21,0,0.65
5,5,330,115,5,4.5,3.0,9.34,1,0.90

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [117]:
# your code here
db["GRE-CGPA"]=db["GRE Score"].astype(str) + "-" + db["CGPA"].astype(str)

In [118]:
db.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,GRE-CGPA
Serial No.,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,337-9.65
2,2,316,104,3,3.0,3.5,8.00,1,0.72,316-8.0
3,3,322,110,3,3.5,2.5,8.67,1,0.80,322-8.67
4,4,314,103,2,2.0,3.0,8.21,0,0.65,314-8.21
5,5,330,115,5,4.5,3.0,9.34,1,0.90,330-9.34

In [119]:
db.index = db["GRE-CGPA"]

In [120]:
db.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,GRE-CGPA
GRE-CGPA,,,,,,,,,,
337-9.65,1,337,118,4,4.5,4.5,9.65,1,0.92,337-9.65
316-8.0,2,316,104,3,3.0,3.5,8.00,1,0.72,316-8.0
322-8.67,3,322,110,3,3.5,2.5,8.67,1,0.80,322-8.67
314-8.21,4,314,103,2,2.0,3.0,8.21,0,0.65,314-8.21
330-9.34,5,330,115,5,4.5,3.0,9.34,1,0.90,330-9.34

In [121]:
db.drop(["GRE Score","CGPA","GRE-CGPA"], axis=1, inplace = True)

In [122]:
db.head()

,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit
GRE-CGPA,,,,,,,
337-9.65,1,118,4,4.5,4.5,1,0.92
316-8.0,2,104,3,3.0,3.5,1,0.72
322-8.67,3,110,3,3.5,2.5,1,0.80
314-8.21,4,103,2,2.0,3.0,0,0.65
330-9.34,5,115,5,4.5,3.0,1,0.90

Replace the index with an index comprised of two columns - `GRE Score` and `CGPA`. Remove the columns from the dataset as well. Make sure to use `inplace=True`.

Now change the index back to a sequence starting at zero using the `reset_index` function. Make sure to use `inplace=True`.

In [124]:
# your code here
db.reset_index(inplace=True)

In [126]:
cpga = db["GRE-CGPA"].str.split("-").str[1]

In [159]:
GRE = db["GRE-CGPA"].str.split("-").str[0]

In [127]:
db.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit
0,337-9.65,1,118,4,4.5,4.5,1,0.92
1,316-8.0,2,104,3,3.0,3.5,1,0.72
2,322-8.67,3,110,3,3.5,2.5,1,0.80
3,314-8.21,4,103,2,2.0,3.0,0,0.65
4,330-9.34,5,115,5,4.5,3.0,1,0.90

In [128]:
db["CGPA"]=cpga

In [160]:
db["GRE"] = GRE

In [161]:
db.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA,GRE
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330

# Challenge 2 - Advanced Functions

In this part of the lab, we would like to test complex conditions on the entire dataset at once. Let's start by finding the number of rows where the CGPA is higher than 9 and the student has conducted research.

In [136]:
reser = db["Research"]==1

In [138]:
db_reser=db[reser]

In [139]:
db_reser.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34
5,321-8.2,6,109,3,3.0,4.0,1,0.75,8.2

In [140]:
CGPA = db_reser["CGPA"].astype(float)>9

In [141]:
db_filtered = db_reser[CGPA]

In [142]:
db_filtered.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34
10,328-9.1,11,112,4,4.0,4.5,1,0.78,9.1
19,328-9.5,20,116,5,5.0,5.0,1,0.94,9.5
20,334-9.7,21,119,5,5.0,4.5,1,0.95,9.7

In [152]:
db_filtered.shape

(101, 9)

Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [143]:
# your code here
DB_CGPA = db[db["CGPA"].astype(float)>9]

In [150]:
DB_CGPA["SOP"].value_counts()

4.5    37
5.0    31
4.0    27
3.5    10
3.0     5
Name: SOP, dtype: int64

In [145]:
DB_CGPA_SOP = DB_CGPA[DB_CGPA["SOP"]<3.5]

In [149]:
DB_CGPA_SOP["SOP"].value_counts()

3.0    5
Name: SOP, dtype: int64

In [147]:
DB_CGPA_SOP.mean()
#chances are 0.802

Serial No.           166.600
TOEFL Score          112.800
University Rating      3.400
SOP                    3.000
LOR                    3.400
Research               0.800
Chance of Admit        0.802
dtype: float64

We would like to create a deciding factor column for each student. We standardize several columns and then pick the most important factor from a lookup table. If the standardized value is above 0.8, the student will be accepted.

We will start by creating a standardized column for `CGPA`, `GRE Score` and `LOR`. We will name these columns `CGPA_std`, `GRE_std`, and `LOR_std` respecively.

Recall that standardizing a column is done by subtracting the mean of the column from all observations in the column and then dividing each observation in the column by the column's standard deviation.

In the cell below, write a standardization function (a function that takes a column as input and returns a standardized column as output). Make sure to use the `numpy` versions of mean and standard deviation.

In [151]:
import numpy as np

In [167]:
db["CGPA"].astype(float).mean()

8.597090909090909

In [169]:
db["CGPA"].astype(float).std()

0.6023853232371412

In [170]:
(db["CGPA"].astype(float) - db["CGPA"].astype(float).mean())/db["CGPA"].astype(float).std()

0      1.747900
1     -0.991211
2      0.121034
3     -0.642597
4      1.233279
         ...
380    0.735259
381    0.851463
382    1.415886
383    0.303641
384    1.764500
Name: CGPA, Length: 385, dtype: float64

In [180]:
def standardize(col):
    """
    This function takes a column from a dataframe 
    and returns a standardized column by subtracting the column's mean
    and dividing by the column's standard deviation.
    """
    mean = db[col].astype(float).mean()
    std = db[col].astype(float).std()
    
    col_stand = (db[col].astype(float) - mean)/std
    
    return col_stand

Now create the standardized columns `CGPA_std`, `GRE_std`, and `LOR_std` and add them to the `admissions` dataframe.

In [181]:
CGPA_std = standardize("CGPA")

In [182]:
GRE_std = standardize("GRE")

In [183]:
LOR_std = standardize("LOR")

In [184]:
db["CGPA_std"] = CGPA_std
db["GRE_std"] = GRE_std
db["LOR_std"] = LOR_std

In [185]:
db.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA,GRE,CGPA_std,GRE_std,LOR_std
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713

In [191]:
db.shape

(385, 13)

We will generate the decision choice at random using the code below. Please run the cell.

In [197]:
# Libraries
from random import choices

In [198]:
std_columns = ['CGPA_std', 'GRE_std', 'LOR_std']

decision_choice = choices(std_columns, k=db.shape[0])

In [200]:
decision_choice[:20]

['CGPA_std',
 'GRE_std',
 'CGPA_std',
 'GRE_std',
 'CGPA_std',
 'CGPA_std',
 'LOR_std',
 'GRE_std',
 'GRE_std',
 'GRE_std',
 'CGPA_std',
 'GRE_std',
 'LOR_std',
 'CGPA_std',
 'CGPA_std',
 'CGPA_std',
 'CGPA_std',
 'CGPA_std',
 'LOR_std',
 'CGPA_std']

Now create the deciding column using the `lookup` function. The lookup column is `decision_choice` found above. Call the column resulting from the lookup function `deciding_column` and add it to the `admissions` dataframe.

In [206]:
db["deciding_column"] = db.lookup(db.index, decision_choice)

In [207]:
db.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA,GRE,CGPA_std,GRE_std,LOR_std,decinding_column,deciding_column
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900,1.747900
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367,-0.063367
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034,0.121034
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391,-0.236391
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279,1.233279

In [209]:
db.drop("decinding_column", axis=1, inplace=True)

In [210]:
db.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA,GRE,CGPA_std,GRE_std,LOR_std,deciding_column
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279

Create a column called `decision` in the `admissions` dataframe. Assign 1 to this column if the value of `deciding_column` is greater than 0.8 and 0 otherwise.

In [ ]:
# Forma de Pau (Genial!)
# admisions_predict["decision"] = np.where(admisions_predict["deciding_column"] > 0.8, 1, 0)

In [211]:
decision = []
for x,y in db.iterrows():
    
    if y["deciding_column"]>0.8:
        decision.append(1)
        
    elif y["deciding_column"]<0.8:
        decision.append(0)

In [212]:
db["decision"]=decision

In [213]:
db.head()

,GRE-CGPA,Serial No.,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit,CGPA,GRE,CGPA_std,GRE_std,LOR_std,deciding_column,decision
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900,1
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367,0
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034,0
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391,0
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279,1

How many applicants will be accepted to the program using the decision column? Compute the result below.

In [217]:
db["decision"].value_counts()

0    300
1     85
Name: decision, dtype: int64

# Challenge 3 - Method Chaining

To increase our coding efficiency, let's make a number of changes to our dataframe in one line of code.

In the cell below, remove all non character symbols from the column names, replace all spaces in column names to underscores, and change all upper case characters to lower case. Assign these new column values to `admissions.columns`.

In [236]:
db.columns

Index(['GRE-CGPA', 'Serial No.', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR', 'Research', 'Chance of Admit', 'CGPA', 'GRE', 'CGPA_std',
       'GRE_std', 'LOR_std', 'deciding_column', 'decision'],
      dtype='object')

In [220]:
import re

In [245]:
new = []
for i in db.columns:

    new.append(re.sub("[^a-zA-Z]+", " ", i).replace(" ", "_").lower())

In [253]:
#1 column
db.columns = [re.sub("[^a-zA-Z]+", " ", i).replace(" ", "_").lower() for i in db.columns]

In [254]:
db.head()

,gre_cgpa,serial_no_,toefl_score,university_rating,sop,lor,research,chance_of_admit,cgpa,gre,cgpa_std,gre_std,lor_std,deciding_column,decision
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900,1
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367,0
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034,0
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391,0
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279,1

In the cell below, give all student with a university rating of 4 or higher a 10 point boost on their GRE score and split the column into 4 bins using the `cut` function. Assign this new score to the variable `adjusted_gre`.

In [258]:
db["new_gre"]=db["gre"].astype(float)

In [259]:
db.head()

,gre_cgpa,serial_no_,toefl_score,university_rating,sop,lor,research,chance_of_admit,cgpa,gre,cgpa_std,gre_std,lor_std,deciding_column,decision,new_gre
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900,1,337.0
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367,0,316.0
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034,0,322.0
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391,0,314.0
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279,1,330.0

In [260]:
adjusted_gree = []
for x,y in db.iterrows():
    
    if y["university_rating"]>=4:
        adjusted_gree.append(y["new_gre"]+10)
        
    else:
        adjusted_gree.append(y["new_gre"])

In [261]:
db["adjusted_gre"] = adjusted_gree

In [262]:
db.head()

,gre_cgpa,serial_no_,toefl_score,university_rating,sop,lor,research,chance_of_admit,cgpa,gre,cgpa_std,gre_std,lor_std,deciding_column,decision,new_gre,adjusted_gre
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900,1,337.0,347.0
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367,0,316.0,316.0
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034,0,322.0,322.0
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391,0,314.0,314.0
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279,1,330.0,340.0

In [270]:
bins=pd.cut(db["adjusted_gre"], bins=4, labels = ["Group4","Group3","Group2","Group1"])

In [271]:
db["Quartile"]=bins

In [272]:
db.head()

,gre_cgpa,serial_no_,toefl_score,university_rating,sop,lor,research,chance_of_admit,cgpa,gre,cgpa_std,gre_std,lor_std,deciding_column,decision,new_gre,adjusted_gre,Quartile
0,337-9.65,1,118,4,4.5,4.5,1,0.92,9.65,337,1.747900,1.753381,1.191647,1.747900,1,337.0,347.0,Group1
1,316-8.0,2,104,3,3.0,3.5,1,0.72,8.0,316,-0.991211,-0.063367,0.076740,-0.063367,0,316.0,316.0,Group3
2,322-8.67,3,110,3,3.5,2.5,1,0.80,8.67,322,0.121034,0.455704,-1.038166,0.121034,0,322.0,322.0,Group2
3,314-8.21,4,103,2,2.0,3.0,0,0.65,8.21,314,-0.642597,-0.236391,-0.480713,-0.236391,0,314.0,314.0,Group3
4,330-9.34,5,115,5,4.5,3.0,1,0.90,9.34,330,1.233279,1.147798,-0.480713,1.233279,1,330.0,340.0,Group1

In [274]:
db.sort_values(by = "adjusted_gre", inplace = True, ascending = False)

In [284]:
db.head()

,gre_cgpa,serial_no_,toefl_score,university_rating,sop,lor,research,chance_of_admit,cgpa,gre,cgpa_std,gre_std,lor_std,deciding_column,decision,new_gre,adjusted_gre,Quartile
192,340-9.91,193,120,5,4.5,4.5,1,0.97,9.91,340,2.179517,2.012916,1.191647,2.179517,1,340.0,350.0,Group1
369,340-9.74,370,113,4,5.0,5.0,1,0.96,9.74,340,1.897306,2.012916,1.749100,1.749100,1,340.0,350.0,Group1
271,340-9.66,272,112,4,5.0,4.5,1,0.94,9.66,340,1.764500,2.012916,1.191647,2.012916,1,340.0,350.0,Group1
136,340-9.92,137,120,4,4.5,4.0,1,0.97,9.92,340,2.196118,2.012916,0.634193,0.634193,0,340.0,350.0,Group1
80,340-9.45,81,115,5,4.5,4.5,1,0.94,9.45,340,1.415886,2.012916,1.191647,2.012916,1,340.0,350.0,Group1